# สร้างโปรแกรมคำนวณเงินเดือนสุทธิที่ต้องจ่ายหลังจากหักภาษีแล้ว 7% ของเงินเดือน  และหักค่าประกันสังคม 3% ของเงินเดือน
# โดยรับค่ารหัสพนักงาน ชื่อพนักงาน เงินเดือน ทางแป้นพิมพ์ และแสดงผลข้อมูลที่รับมา
# พร้อมกับรายละเอียดว่าต้องเสียภาษีกี่บาท หักค่าประกันสังคมกี่บาท และต้องจ่ายเงินเดือนสุทธิกี่บาท
fullname = input('ชื่อ: ')
number= input('รหัสพนังงาน: ')
salary = input('เงินเดือน: ')
tax = float(salary) * 0.07 
insurence = float(salary) * 0.03
salaryfull = float(salary) - tax - insurence
print('--------------------------------------------------')
print('สวัสดี', fullname ,'รหัส',number,'เงินเดือน',salary)
print('หักภาษี' ,tax ,'บาท')
print('หักค่าประกันสังคม', insurence ,'บาท')
print('ต้องจ่ายเงินเดือนสุทธิ', salaryfull  ,'บาท')
print('--------------------------------------------------')
print(f'สวัสดี {fullname} รหัส {number}เงินเดือน{salary}')
print(f'หักภาษี {tax} บาท')
print(f'หักค่าประกันสังคม {insurence} บาท')
print(f'ต้องจ่ายเงินเดือนสุทธิ {salaryfull}  บาท')
print('--------------------------------------------------')
print('สวัสดี {} รหัส {}เงินเดือน {}'.format(fullname,number,salary))
print('หักภาษี {} บาท'.format(tax))
print('หักค่าประกันสังคม {} บาท'.format(insurence))
print('ต้องจ่ายเงินเดือนสุทธิ {} บาท'.format(salaryfull))
print('--------------------------------------------------')
print('สวัสดี '+ str(fullname) +'รหัส '+ str(number) + 'เงินเดือน '+ str(salary))
print('หักภาษี ' + str(tax) + ' บาท')
print('หักค่าประกันสังคม '+ str(insurence) + ' บาท')
print('ต้องจ่ายเงินเดือนสุทธิ '+ str(salaryfull)  +' บาท')