# โปรแกรมทายตัวเลข โดยมีการทำงานของโปรแกรมดังนี้
# - ให้ผู้ใช้ทายตัวเลขโดยการป้อนตัวเลขทางแป้นพิมพ์
# - โดยกรณีที่ตัวเลขที่ป้อนมีค่าเท่ากับ 59 ให้แสดงข้อความ “ยินดีด้วยคุณทายถูก”
# - แต่หากตัวเลขที่ป้อนมีค่ามากหรือน้อยกว่า 59 ให้แสดงข้อความ “คุณทายผิดตัวเลขที่ป้อนมากไป” หรือ “คุณทายผิดตัวเลขที่ป้อนน้อยไป” และให้ผู้ใช้ป้อนใหม่  โดยโปรแกรมจะวนให้ผู้ใช้ป้อนไปเรื่อยๆ จนกว่าจะทายถูก
print('โปรแกรมทายตัวเลข')
print('-------------------------------------------')
while True :
    num = int(input('ป้อนตัวเลข : '))
    if num == 59 :
        print('ยินดีด้วยคุณทายถูก')
        break
    elif num > 59 :
        print('คุณทายผิดตัวเลขที่ป้อนมากไป')
        print('-------------------------------------------')
    else :
        print('คุณทายผิดตัวเลขที่ป้อนน้อยไป')
        print('-------------------------------------------')
print('-------------------------------------------')