# โปรแกรมตรวจสอบรถว่าผ่านเกณฑ์ของการตรวจสอบค่าคาร์บอนไดซ์ออกไซน์หรือ โดยหากค่าคาร์บอนไดซ์ออกไซน์มีค่าเกินกว่า 678.55 
# ให้แสดงข้อความว่า “ไม่ผ่าน”  หากน้อยกว่า 678.55 ให้แสดงข้อความ “ผ่าน” 
# โดยให้รับชื่อเจ้าของ ทะเบียนรถ และปริมาณก๊าซคาร์บอนไดซ์ออกไซน์ที่วัดได้ ทางแป้นพิมพ์

print('โปรแกรมตรวจสอบค่าคาร์บอนไดซ์ออกไซน์')
print('--------------------------------')
car_owner = input('ชื่อเจ้าของรถ : ')
car_number = input('ทะเบียนรถ : ')
gas = float(input('ปริมาณก๊าซคาร์บอนไดซ์ออกไซน์ : '))

if gas > 678.55:
    print('ทะเบียน', car_number, 'ของ', car_owner, 'ไม่ผ่าน')
else:
    print('ทะเบียน', car_number, 'ของ', car_owner, 'ผ่าน')
print('---------------------------------------------------')