# สร้างโปรแกรมคำนวณผลคูณของตัวเลข 2 จำนวนที่รับทางแป้นพิมพ์ แล้วแสดงผลทางหน้าจอ ทั้งนี้โปรแกรมจะทำการคำนวณผลคูณจากตัวเลขที่รับทางแป้นพิมพ์ไปเรื่อยๆ จนกว่าผลคูณจะมากกว่า 5000 ถึงจะหยุดการทำงาน
print('โปรแกรมคำนวณผลคูณของตัวเลข 2 จำนวน')
print('-------------------------------------------')
while True :
    num1 = int(input('ป้อนตัวเลขที่ 1 : '))
    num2 = int(input('ป้อนตัวเลขที่ 2 : '))
    result = num1 * num2 
    if result > 5000 :
        break
    print('ผลคูณของ', num1, 'และ', num2, 'คือ', result)
    print('-------------------------------------------')
print('ผลคูณของ', num1, 'และ', num2, 'คือ', result)