#สร้างโปรแกรมคำนวณอายุของจากปีเกิด (พ.ศ.) ของพนักงานโรงงานแห่งหนึ่ง โดยป้อนชื่อและปีเกิดทางแป้นพิมพ์ ทั้งนี้โปรแกรมจะหยุดทำงานก็ต่อเมมื่อป้อนชื่อพนักงาน เป็น SAU ก็จะหยุดทำงาน
print('โปรแกรมคำนวณอายุของจากปีเกิดของพนักงานโรงงาน')
print('-------------------------------------------')
from datetime import datetime

while True :
    name = input('ป้อนชื่อพนักงาน: ')
    if name.upper() == 'SAU':
        break
    year = int(input('ป้อนปีเกิดของพนักงาน: '))
    age = (datetime.now().year + 543 )- year
    print('อายุของพนักงาน', name, 'คือ', age, 'ปี')
    print('-------------------------------------------')