# โปรแกรมคำนวณราคาสินค้าที่รับส่วนลดแล้ว โดยป้อนรหัสสินค้า ชื่อสินค้า ประเภทสินค้า ซึ่งมี 4 ประเภท คือ food(F/f), woman(W/w), man(M/m), kitchen(K/k) โดยป้อนเป็นตัวย่อ  และราคาสินค้าทางแป้นพิมพ์ แล้วคำนวณราคาสินค้าที่รับส่วนลดแล้วทางหน้าจอ โดยสินค้าประเภท food ลด 2% ของราคาสินค้า, woman ลด 4% ของราคาสินค้า, man ลด 6% ของราคาสินค้า, kitchen ลด 10% ของราคาสินค้า หากป้อนประเภทสินค้าผิดจากที่กำหนดให้แสดงข้อความ "คุณป้อนประเภทผิด !!!"
print('โปรแกรมคำนวณราคาสินค้าที่รับส่วนลดแล้ว')
print('--------------------------------------------------')
code = input('ป้อนรหัสสินค้า: ')
name = input('ป้อนชื่อสินค้า: ')
type = input('ป้อนประเภทสินค้า: ')
price = float(input('ป้อนราคาสินค้า: '))
print('--------------------------------------------------')

if type == 'F' or type == 'f':
    price = price - (price * 0.02)
    print('ราคาสินค้าสุทธิ', price, 'บาท')
elif type == 'W' or type == 'w':
    price = price - (price * 0.04)
    print('ราคาสินค้าสุทธิ', price, 'บาท')
elif type == 'M' or type == 'm':
    price = price - (price * 0.06)
    print('ราคาสินค้าสุทธิ', price, 'บาท')
elif type == 'K' or type == 'k':
    price = price - (price * 0.1)
    print('ราคาสินค้าสุทธิ', price, 'บาท')
else:
    print('คุณป้อนประเภทผิด !!!')
