#โปรแกรมคำนวณค่าคอมมิชชั่นของพนักงานขาย โดยป้อนรหัสพนักงาน ชื่อพนักงาน และจำนวนเงินซึ่งเป็นยอดขายของพนักงาน จากผู้ใช้ทางแป้นพิมพ์ และคำนวณค่าคอมมิชชั่น จากเงื่อนไข ดังนี้
#     ขายของได้ไม่เกิน 1000 บาท ค่าคอมมิชชั่น เป็น 0.0 บาท
#    ขายของได้ตั้งแต่ 1001 – 2000  บาท ค่าคอมมิชชั่นคิด 	1% จากยอดขาย
#     ขายของได้ตั้งแต่ 2001 – 3000  บาท ค่าคอมมิชชั่นคิด 	3% จากยอดขาย
#     ขายของได้ตั้งแต่ 3001  บาท ขึ้นไป ค่าคอมมิชชั่นคิด 	5% จากยอดขาย
print('โปรแกรมคํานวณค่าคอมมิชชั่นของพนักงานขาย')
print('--------------------------------------------------')
id = int(input('ป้อนรหัสพนักงาน: '))
name = input('ป้อนชื่อพนักงาน: ')
sale = float(input('ป้อนยอดขาย: '))
print('--------------------------------------------------')

if sale <= 1000:
    commission = 0.0
elif 1001 <= sale <= 2000:
    commission = sale * 0.01
elif 2001 <= sale <= 3000:
    commission = sale * 0.03
else:
    commission = sale * 0.05

print('รหัสพนักงาน: ', id)
print('ชื่อพนักงาน: ', name)
print('ยอดขาย: ', sale)
print('ค่าคอมมิชชั่น: ', commission)