# โปรแกรมตรวจสอบน้ำหนักรถบรรทุก ว่ารถบรรทุกนั้นมีน้ำหนักรถผ่านเกณฑ์หรือไม่ หากน้ำหนักเกิน 1000 ให้แสดงข้อความว่า "รถทะเบียน ???? น้ำหนักรถไม่ผ่านเกณฑ์"  แต่หากน้ำหนักตั้งแต่ 1000 ลงมาให้แสดงข้อความว่า "รถทะเบียน ???? น้ำหนักรถผ่านเกณฑ์" โดยให้ป้อนทะเบียนรถบรรทุก และน้ำหนักรถบรรทุกทางแป้นพิมพ์
print('โปรแกรมตรวจสอบน้ำหนักรถบรรทุก')
print('------------------------------------------')

license = input('ป้อนทะเบียนรถ : ')
weight = int(input('ป้อนน้ำหนักรถ : ')) 

if weight > 1000:
    print('รถทะเบียน', license, 'น้ำหนักรถไม่ผ่านเกณฑ์')
else:
    print('รถทะเบียน', license, 'น้ำหนักรถผ่านเกณฑ์')

print('------------------------------------------')