# โปรแกรมซึ่งรับชื่อ และปีเกิดของผู้ใช้โปรแกรมทางแป้นพิมพ์ โดยหากอายุที่ผู้ใช้ป้อนมีค่าตั้งแต่ 35 ปีขึ้นไป 
# ให้แสดงข้อความว่า "คุณแก่แล้ว..." หากไม่ถึงให้แสดงข้อความ "คุณยังไม่แก่..." ทางหน้าจอ

from datetime import datetime

print("โปรแกรมตรวจสอบอายุ")
print("----------------------------------------")
name = input("ป้อนชื่อของคุณ : ")
year = int(input("ป้อนปีเกิดของคุณ (พ.ศ.) : "))
print("----------------------------------------")

age = (datetime.now().year + 543 )- year

if age >= 35:
    print("คุณ", name,"อายุ", age, "คุณแก่แล้ว...")
else:
    print("คุณ", name,"อายุ", age,"คุณยังไม่แก่...")

print("----------------------------------------")