# assignment operator กำหนดค่อ คือ เครื่องหมาย =
# การทำงานของ = คือ เอาทางขาวไปใส่ซ้าย
# ยกเว้นแต่ว่า สิ่งที่อยู่ทางขาวมีการทำงานใดๆ ทำเสร็จแล้วเอาไปใส่ทางซ้าย
# ตัวแปร (variable) = ข้อมูล (data)/ นิพจน์ (expression)
# *** ตัวแปร (variable) คือ ชื่อที่ Dev. ตั้งมาไว้เก็บข้อมูล ***
# *** การใช้งานตัวแปร คือ เอาข้อมูลไปใส่ในตัวแปร หรือ เอาข้อมูลที่มันเก็บอยู่มาใช้ ***

score = 20
fullname = 'ชาย'
salary = input('ป้อนเงินเดือน: ')
sum = 20 + 30 
print('----------------------------')
num = 10  # num = num + 10
num += 10 # num = num - 10
num -= 10 # num = num * 2 
num *= 2  # num = num / 2
num /= 2  # num = num % 2 
num %= 2  # num = num //2
num //= 2 
print(num)
